w3d3/URLShortener/app/models/shortened_url.rb

  def no_spamming
    recently_created = ShortenedUrl.all
    .where('user_id = ?', user_id)
    .where('created_at > ?', 1.minutes.ago)
    .count
---
SELECT COUNT(*) FROM "shortened_urls" WHERE (user_id = 22) AND (created_at > '2022-04-17 04:08:00.806486')

  def nonpremium_max
    url_count = User.find_by(id: user_id).submitted_urls.count
---
SELECT COUNT(*) FROM "shortened_urls" WHERE "shortened_urls"."user_id" = $1  [["user_id", 22]]

  def self.random_code
    url = nil
    until url
      url = SecureRandom.urlsafe_base64
      url = nil if ShortenedUrl.exists?(short_url: url)
---
SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "YL5dUM9uBGO0TPSXKe7jHA"], ["LIMIT", 1]]

  def self.create_from_url(user, long_url)
    short_url = ShortenedUrl.random_code
    ShortenedUrl.create!(short_url: short_url, long_url: long_url, user_id: user.id)
---
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "BKEeOb8rwV1r7ix4Z-ysjw"], ["long_url", "Ruby on Rails.com"], ["user_id", 2], ["created_at", "2022-04-17 00:02:52.701456"], ["updated_at", "2022-04-17 00:02:52.701456"]]
INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "YL5dUM9uBGO0TPSXKe7jHA"], ["long_url", "Ruby on Rails.com"], ["user_id", 22], ["created_at", "2022-04-17 04:09:00.821095"], ["updated_at", "2022-04-17 04:09:00.821095"]]

  def self.prune(n)
    to_prune = ShortenedUrl
    .joins('LEFT JOIN visits ON shortened_urls.id = visits.shortened_url_id')
    .joins('JOIN users ON shortened_urls.user_id = users.id')
    .where('users.premium = false AND shortened_urls.created_at <= ?', n.minutes.ago)
    .group('shortened_urls.id')
    .having('COALESCE(MAX(visits.created_at), ?) <= ?', n.hours.ago, n.minutes.ago)
    .select('shortened_urls.*')
    .destroy_all
---
SELECT shortened_urls.* FROM "shortened_urls" LEFT JOIN visits ON shortened_urls.id = visits.shortened_url_id JOIN users ON shortened_urls.user_id = users.id WHERE (users.premium = false AND shortened_urls.created_at <= '2022-04-17 04:32:52.066861') GROUP BY "shortened_urls"."id" HAVING (COALESCE(MAX(visits.created_at), '2022-04-14 17:32:52.075640') <= '2022-04-17 04:32:52.075654')